sample-xml-requests/sample_registration_request.xml

<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?><s:Envelope xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:wsn-b=\"http://docs.oasis-open.org/wsn/b-2\" xmlns:wsn-br=\"http://docs.oasis-open.org/wsn/br-2\" xmlns:wsn-bw=\"http://docs.oasis-open.org/wsn/bw-2\" xmlns:wsn-brw=\"http://docs.oasis-open.org/wsn/brw-2\" xmlns:wsrf-bf=\"http://docs.oasis-open.org/wsrf/bf-2\" xmlns:wsrf-bfw=\"http://docs.oasis-open.org/wsrf/bfw-2\" xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\"><s:Header><wsa:Action>http://docs.oasis-open.org/wsn/brw-2/RegisterPublisher/RegisterPublisherRequest</wsa:Action></s:Header><s:Body><wsn-br:RegisterPublisher><wsn-br:PublisherReference><wsa:Address>http://localhost:8084</wsa:Address></wsn-br:PublisherReference><wsn-br:Topic Dialect=\"http://docs.oasis-open.org/wsn/t-1/TopicExpression/Concrete\">no/ffi</wsn-br:Topic><wsn-br:Demand>false</wsn-br><wsn-br:InitialTerminationTime>2015-12-25T00:00:00.00000Z</wsn-br:InitialTerminationTime></s:Body></s:Envelope>
